[Killed] BlockStatement
Code/order-api/src/app.ts:13:17
   public apiRoutes: APIRoute = new APIRoute()
   public orderRoutes: OrderRoute = new OrderRoute()
 
-  constructor() {
-    this.app = express()
-    this.app.use(bodyParser.json())
-    this.userRoutes.routes(this.app)
-    this.apiRoutes.routes(this.app)
-    this.orderRoutes.routes(this.app)
-
-  }
+  constructor() {}
 }
 
killedBy: userRoute should respond with HTTP 404 status because there is no order
statusReason: Cannot read property 'address' of undefined
