[Killed] ConditionalExpression
order-api/src/controllers/order.ts:10:36
 
 export let getOrder = (req: Request, res: Response, next: NextFunction) => {
   const id = req.params.id
-  const order = orders.find(obj => obj.id === Number(id))
+  const order = orders.find(obj => true)
   const httpStatusCode = order ? 200 : 404
   return res.status(httpStatusCode).send(order)
killedBy: userRoute should return the order created on the step before
statusReason: expected 404 to equal 200

[Killed] ConditionalExpression
order-api/src/controllers/order.ts:31:47
 
 export let removeOrder = (req: Request, res: Response, next: NextFunction) => {
   const id = Number(req.params.id)
-  const orderIndex = orders.findIndex(item => item.id === id)
+  const orderIndex = orders.findIndex(item => false)
 
   if (orderIndex === -1) {
killedBy: userRoute should remove an existing order
statusReason: expected 404 to equal 204

[Killed] EqualityOperator
order-api/src/controllers/order.ts:33:7
   const id = Number(req.params.id)
   const orderIndex = orders.findIndex(item => item.id === id)
 
-  if (orderIndex === -1) {
+  if (orderIndex !== -1) {
     return res.status(404).send()
   }
killedBy: userRoute should return 404 when it is trying to remove an order because the order does not exist
statusReason: expected 204 to equal 404

[Killed] ConditionalExpression
order-api/src/controllers/order.ts:37:34
     return res.status(404).send()
   }
 
-  orders = orders.filter(item => item.id !== id)
+  orders = orders.filter(item => true)
 
   return res.status(204).send()
killedBy: userRoute should remove an existing order
statusReason: expected 404 to equal 204

[Killed] ArrowFunction
order-api/src/controllers/order.ts:37:26
     return res.status(404).send()
   }
 
-  orders = orders.filter(item => item.id !== id)
+  orders = orders.filter(() => undefined)
 
   return res.status(204).send()
killedBy: userRoute should remove an existing order
statusReason: expected 404 to equal 204

[Timeout] BlockStatement
order-api/src/controllers/order.ts:42:80
   return res.status(204).send()
 }
 
-export let getInventory = (req: Request, res: Response, next: NextFunction) => {
-  const grouppedOrders = _.groupBy(orders, 'userId')
-  return res.status(200).send(grouppedOrders)
-}
+export let getInventory = (req: Request, res: Response, next: NextFunction) => {}
