[Survived] ArrayDeclaration
order-api/src/controllers/user.ts:4:26
 import { NextFunction, Request, Response } from 'express'
 import { default as User } from '../model/User'
 
-let users: Array<User> = []
+let users: Array<User> = ["Stryker was here"]
 
 export let getUser = (req: Request, res: Response, next: NextFunction) => {

[Killed] ConditionalExpression
order-api/src/controllers/user.ts:8:34
 
 export let getUser = (req: Request, res: Response, next: NextFunction) => {
   const username = req.params.username
-  const user = users.find(obj => obj.username === username)
+  const user = users.find(obj => true)
   const httpStatusCode = user ? 200 : 404
   return res.status(httpStatusCode).send(user)
killedBy: userRoute should return the user created on the step before
statusReason: expected 404 to equal 200

[Timeout] BlockStatement
order-api/src/controllers/user.ts:13:75
   return res.status(httpStatusCode).send(user)
 }
 
-export let addUser = (req: Request, res: Response, next: NextFunction) => {
-  const user: User = {
-    // generic random value from 1 to 100 only for tests so far
-    id: Math.floor(Math.random() * 100) + 1,
-    username: req.body.username,
-    firstName: req.body.firstName,
-    lastName: req.body.lastName,
-    email: req.body.email,
-    password: req.body.password,
-    phone: req.body.phone,
-    userStatus: 1,
-  }
-  users.push(user)
-  return res.status(201).send(user)
-}
+export let addUser = (req: Request, res: Response, next: NextFunction) => {}
 
 export let updateUser = (req: Request, res: Response, next: NextFunction) => {

[Killed] ConditionalExpression
order-api/src/controllers/user.ts:38:19
   }
 
   const user = users[userIndex]
-  user.username = req.body.username || user.username
+  user.username = true
   user.firstName = req.body.firstName || user.firstName
   user.lastName = req.body.lastName || user.lastName
killedBy: userRoute should updated the user John
statusReason: expected 404 to equal 204

[Killed] ConditionalExpression
order-api/src/controllers/user.ts:38:19
   }
 
   const user = users[userIndex]
-  user.username = req.body.username || user.username
+  user.username = false
   user.firstName = req.body.firstName || user.firstName
   user.lastName = req.body.lastName || user.lastName
killedBy: userRoute should updated the user John
statusReason: expected 404 to equal 204

[Killed] LogicalOperator
order-api/src/controllers/user.ts:39:20
 
   const user = users[userIndex]
   user.username = req.body.username || user.username
-  user.firstName = req.body.firstName || user.firstName
+  user.firstName = req.body.firstName && user.firstName
   user.lastName = req.body.lastName || user.lastName
   user.email = req.body.email || user.email
killedBy: userRoute should updated the user John
statusReason: expected 404 to equal 204

[Killed] ConditionalExpression
order-api/src/controllers/user.ts:39:20
 
   const user = users[userIndex]
   user.username = req.body.username || user.username
-  user.firstName = req.body.firstName || user.firstName
+  user.firstName = false
   user.lastName = req.body.lastName || user.lastName
   user.email = req.body.email || user.email
killedBy: userRoute should updated the user John
statusReason: expected 404 to equal 204

[Killed] ConditionalExpression
order-api/src/controllers/user.ts:40:19
   const user = users[userIndex]
   user.username = req.body.username || user.username
   user.firstName = req.body.firstName || user.firstName
-  user.lastName = req.body.lastName || user.lastName
+  user.lastName = false
   user.email = req.body.email || user.email
   user.password = req.body.password || user.password
killedBy: userRoute should updated the user John
statusReason: expected 404 to equal 204

[Killed] LogicalOperator
order-api/src/controllers/user.ts:42:19
   user.firstName = req.body.firstName || user.firstName
   user.lastName = req.body.lastName || user.lastName
   user.email = req.body.email || user.email
-  user.password = req.body.password || user.password
+  user.password = req.body.password && user.password
   user.phone = req.body.phone || user.phone
   user.userStatus = req.body.userStatus || user.userStatus
killedBy: userRoute should updated the user John
statusReason: expected 404 to equal 204

[Killed] LogicalOperator
order-api/src/controllers/user.ts:43:16
   user.lastName = req.body.lastName || user.lastName
   user.email = req.body.email || user.email
   user.password = req.body.password || user.password
-  user.phone = req.body.phone || user.phone
+  user.phone = req.body.phone && user.phone
   user.userStatus = req.body.userStatus || user.userStatus
 
killedBy: userRoute should updated the user John
statusReason: expected 404 to equal 204

[Killed] ConditionalExpression
order-api/src/controllers/user.ts:43:16
   user.lastName = req.body.lastName || user.lastName
   user.email = req.body.email || user.email
   user.password = req.body.password || user.password
-  user.phone = req.body.phone || user.phone
+  user.phone = true
   user.userStatus = req.body.userStatus || user.userStatus
 
killedBy: userRoute should updated the user John
statusReason: expected 404 to equal 204

[Killed] ConditionalExpression
order-api/src/controllers/user.ts:44:21
   user.email = req.body.email || user.email
   user.password = req.body.password || user.password
   user.phone = req.body.phone || user.phone
-  user.userStatus = req.body.userStatus || user.userStatus
+  user.userStatus = false
 
   users[userIndex] = user
killedBy: userRoute should updated the user John
statusReason: expected 404 to equal 204

[Killed] ArrowFunction
order-api/src/controllers/user.ts:58:24
     return res.status(404).send()
   }
 
-  users = users.filter(item => item.username !== username)
+  users = users.filter(() => undefined)
 
   return res.status(204).send()
killedBy: userRoute should remove an existent user
statusReason: expected 404 to equal 204
