[Killed] StringLiteral
order-api/src/routes/user.ts:7:15
   public routes(app): void {
     app.route('/users').post(userController.addUser)
     app.route('/users/:username').patch(userController.updateUser)
-    app.route('/users/:username').delete(userController.removeUser)
+    app.route("").delete(userController.removeUser)
     app.route('/users/:username').get(userController.getUser)
   }
killedBy: userRoute should remove an existent user
statusReason: expected 404 to equal 204
